tap "daipeihust/tap"
tap "federico-terzi/espanso"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "zegervdv/zathura"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: false
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# X.509 and CMS library
brew "libksba"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node", link: false
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Switch your input method through terminal
brew "daipeihust/tap/im-select"
brew "zegervdv/zathura/zathura", args: ["HEAD"]
brew "zegervdv/zathura/zathura-pdf-poppler"
# Open-source markdown editor
cask "zettlr"
